stremio-youtube-manager/app/views/home/index.html.erb

            <span class="badge badge-series">Series</span>
            &nbsp;<%= show.seasons.count %> season(s)
---
SELECT COUNT(*) FROM "seasons" WHERE "seasons"."show_id" = 1