stremio-youtube-manager/app/views/shows/show.html.erb


<% if @show.seasons.any? %>
---
SELECT 1 AS one FROM "seasons" WHERE "seasons"."show_id" = 1 LIMIT 1