stremio-youtube-manager/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "imdb_id", "youtube_link", "is_embeddable", "created_at", "updated_at") VALUES ('Hindi Medium', 'tt5764096', 'https://www.youtube.com/watch?v=6M191qGTZA4&pp=ygUTbW92aWVzIGhpbmRpIG1lZGl1bQ%3D%3D', TRUE, '2026-05-19 03:46:13.195377', '2026-05-19 03:46:13.195377') RETURNING "id"

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "youtube_link" = 'https://www.youtube.com/watch?v=6M191qGTZA4', "updated_at" = '2026-05-19 03:46:28.795278' WHERE "movies"."id" = 1

  def destroy
    @movie.destroy!
---
DELETE FROM "movies" WHERE "movies"."id" = 1

    def set_movie
      @movie = Movie.find(params.expect(:id))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1