stremio-youtube-manager/app/controllers/seasons_controller.rb

  def create
    @season = @show.seasons.new(season_params)
    if @season.save
---
INSERT INTO "seasons" ("show_id", "imdb_id", "season_number", "youtube_playlist_link", "created_at", "updated_at") VALUES (1, NULL, 1, 'https://www.youtube.com/playlist?list=PLCqMXmBveulAmR0o5plQi9d0S-dnrP3j5', '2026-05-19 07:13:28.132294', '2026-05-19 07:13:28.132294') RETURNING "id"

  def set_show
    @show = Show.find(params[:show_id])
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1

  def set_season
    @season = @show.seasons.find(params[:id])
---
SELECT "seasons".* FROM "seasons" WHERE "seasons"."show_id" = 1 AND "seasons"."id" = 1 LIMIT 1