stremio-youtube-manager/app/controllers/shows_controller.rb

  def create
    @show = Show.new(show_params)

    respond_to do |format|
      if @show.save
---
INSERT INTO "shows" ("title", "imdb_id", "poster_url", "created_at", "updated_at") VALUES ('Best of Luck Nikki', 'tt1949650', '', '2026-05-19 07:04:31.987950', '2026-05-19 07:04:31.987950') RETURNING "id"

    def set_show
      @show = Show.find(params.expect(:id))
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1