app/controllers/api/v1/movies_controller.rb

      def index
        render json: Movie.all
---
SELECT "movies".* FROM "movies"

      def show
        @movie = Movie.find_by!(imdb_id: params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."imdb_id" = 'tt2168910' LIMIT 1