app/controllers/home_controller.rb

SELECT "movies".* FROM "movies"
SELECT "shows".* FROM "shows"
---
  def index
    @movies = Movie.all
    @shows = Show.all